In [1]:
import pandas as pd

In [5]:
data = [1,2,3,4,5,6,7,8,9,10]
df = pd.DataFrame(data,columns=['Numbers'])
df

   Numbers
0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8
8        9
9       10

In [6]:
data = [["Ali",15],["Mohamed",22],["Mark",30],["Ahmed",25]]
df = pd.DataFrame(data,columns=["Name","Age"])
df

      Name  Age
0      Ali   15
1  Mohamed   22
2     Mark   30
3    Ahmed   25

In [8]:
data = { 
        "Name" : ["Ali","Mohamed","Mark","Ahmed"],
        "Age" : [15 , 22 , 30 , 25]}
df = pd.DataFrame(data)
df

      Name  Age
0      Ali   15
1  Mohamed   22
2     Mark   30
3    Ahmed   25

In [10]:
df = pd.DataFrame(data,index=["1st","2st","3st","4st"])
df

        Name  Age
1st      Ali   15
2st  Mohamed   22
3st     Mark   30
4st    Ahmed   25